<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"fbffef9d33ea32e37fdab02ecc9145a99520c7f21add907a46c17663ffc5fbdd","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #727 at https://github.com/cal-itp/data-infra/actions/runs/18109943701","plan_out_hash":"b0c3dec0696f7e13206be367ea68ada84fa379b66797fbbeb1d236eb33e30ebe","plan_hash":"f4f3dfb161a977bb9f17cc84b81b9124ce1eec9a0b98880486f7757af6c1608f","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 0 to add, 2 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "KuLjeg==" -> (known after apply)
!~      detect_md5hash      = "rl7uuOKOBFKKXJB7G5Lllg==" -> "different hash"
!~      generation          = 1758837032365928 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "rl7uuOKOBFKKXJB7G5Lllg==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "t+hzLg==" -> (known after apply)
!~      detect_md5hash      = "sOOMO6TDeVbnw881OqCbPg==" -> "different hash"
!~      generation          = 1758837034146140 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "sOOMO6TDeVbnw881OqCbPg==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #727](https://github.com/cal-itp/data-infra/actions/runs/18109943701)